УТ.УчетЗадач/src/InformationRegisters/cbr_ИсполнителиЗадач/cbr_ИсполнителиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_ИсполнителиЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.cbr_Роли</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.cbr_ГруппыДоступаКЗадачам</types>
    </type>
  </resources>
  <resources>
    <name>ЗадачаВзята</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/InformationRegisters/cbr_ИсполнителиЗадач/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область СлужебныеПроцедурыИФункции
// Установить взята в работу для последнего исполнителя
// Параметры:
//  Задача - ДокументСсылка.cbr_Задача
//  Исполнитель - СправочникСсылка.Пользователи.
//				- СправочникСсылка.cbr_Роли. 
//				- СправочникСсылка.cbr_ГруппыДоступаКЗадачам. 
//  Взята - Булево
//	ПричинаОтказа - СправочникСсылка.cbr_ПричиныОтказаОтЗадачи
Процедура ИзменениеПоследнейЗаписи(Задача, Исполнитель, Взята, ПричинаОтказа = Неопределено) Экспорт 
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Задача.Установить(Задача);
	Набор.Прочитать();
	
	Запись = Набор[Набор.Количество() - 1];	
	Если Исполнитель <> Запись.Исполнитель Тогда
		Набор.Записать();
		ЗаписатьИсполнителя(Задача, Исполнитель, Взята);
	Иначе
		Запись.ЗадачаВзята = Взята;
		Запись.ПричинаОтказа = ПричинаОтказа;
		Набор.Записать();
	КонецЕсли;
		
КонецПроцедуры

// Создать запись в регистр сведений
// Параметры:
//  Задача - ДокументСсылка.cbr_Задача
//  Исполнитель - СправочникСсылка.Пользователи.
//				- СправочникСсылка.cbr_Роли. 
//				- СправочникСсылка.cbr_ГруппыДоступаКЗадачам. 
//  Взята - Булево
Процедура ЗаписатьИсполнителя(Задача, Исполнитель, Взята = Ложь) Экспорт
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Исполнитель = Исполнитель;
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.ЗадачаВзята = Взята;
	МенеджерЗаписи.Записать();
КонецПроцедуры
#КонецОбласти
#КонецЕсли
